In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sn
import pylab as pl

In [2]:
train = pd.read_csv('data/Data_Train.csv')
train.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.2,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.7,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.8,5.0,NaN,17.74

In [3]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 13 columns):
Name                 6019 non-null object
Location             6019 non-null object
Year                 6019 non-null int64
Kilometers_Driven    6019 non-null int64
Fuel_Type            6019 non-null object
Transmission         6019 non-null object
Owner_Type           6019 non-null object
Mileage              6017 non-null float64
Engine               5983 non-null float64
Power                5983 non-null object
Seats                5977 non-null float64
New_Price            824 non-null object
Price                6019 non-null float64
dtypes: float64(4), int64(2), object(7)
memory usage: 611.4+ KB

In [4]:
train.columns

Index(['Name', 'Location', 'Year', 'Kilometers_Driven', 'Fuel_Type',
       'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats',
       'New_Price', 'Price'],
      dtype='object')

In [5]:
train = train.drop(['Name', 'Location', 'Fuel_Type', 'Transmission', 'Owner_Type', 'Engine', 'Power', 'New_Price', 'Mileage', 'Seats'], axis = 1)
train.head()

   Year  Kilometers_Driven  Price
0  2010              72000   1.75
1  2015              41000  12.50
2  2011              46000   4.50
3  2012              87000   6.00
4  2013              40670  17.74

In [6]:
train_x = train.drop(['Price'], axis = 1)

In [7]:
train_y = train['Price']

In [8]:
test = pd.read_excel('data/Data_Test.xlsx')
test.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price
0,Maruti Alto K10 LXI CNG,Delhi,2014,40929,CNG,Manual,First,32.26 km/kg,998 CC,58.2 bhp,4.0,NaN
1,Maruti Alto 800 2016-2019 LXI,Coimbatore,2013,54493,Petrol,Manual,Second,24.7 kmpl,796 CC,47.3 bhp,5.0,NaN
2,Toyota Innova Crysta Touring Sport 2.4 MT,Mumbai,2017,34000,Diesel,Manual,First,13.68 kmpl,2393 CC,147.8 bhp,7.0,25.27 Lakh
3,Toyota Etios Liva GD,Hyderabad,2012,139000,Diesel,Manual,First,23.59 kmpl,1364 CC,null bhp,5.0,NaN
4,Hyundai i20 Magna,Mumbai,2014,29000,Petrol,Manual,First,18.5 kmpl,1197 CC,82.85 bhp,5.0,NaN

In [9]:
test.columns

Index(['Name', 'Location', 'Year', 'Kilometers_Driven', 'Fuel_Type',
       'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats',
       'New_Price'],
      dtype='object')

In [10]:
test = test.drop(['Name', 'Location', 'Fuel_Type', 'Transmission', 'Owner_Type', 'Engine', 'Power', 'New_Price', 'Mileage', 'Seats'], axis = 1)
test.head()

   Year  Kilometers_Driven
0  2014              40929
1  2013              54493
2  2017              34000
3  2012             139000
4  2014              29000

In [11]:
train_x.shape

(6019, 2)

In [12]:
train_y.shape

(6019,)

In [13]:
test.shape

(1234, 2)

In [14]:
train['Price'] = train['Price'].astype('int')
train.head()

   Year  Kilometers_Driven  Price
0  2010              72000      1
1  2015              41000     12
2  2011              46000      4
3  2012              87000      6
4  2013              40670     17

In [15]:
from sklearn import linear_model
regr = linear_model.LinearRegression()

In [16]:
regr.fit(train_x, train_y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [22]:
train_y[0:10]

0     1.75
1    12.50
2     4.50
3     6.00
4    17.74
5     2.35
6     3.50
7    17.50
8     5.20
9     1.95
Name: Price, dtype: float64

In [19]:
ypred = regr.predict(test)
ypred

array([10.07312596,  9.07403038, 13.24680413, ...,  7.86566099,
        9.06237474, 10.23776771])